cf/DataProcessors/СравнениеДвиженийС81.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СравнениеДвиженийС81</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Резерв</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ВнутреннийЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВнутреннийЗаказ</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупитьНедостающее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозничнаяЗаявка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиВЗакупку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазмещенияБезЗаказа</Name>
					<Comment>Если стоит значит резервироваться будет без учета сумм и заказа (новый вид ререзрвов)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаДляОповещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Почта</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъедененнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъедененнаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВыдачиИнструмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияВыдачиИнструмента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннегоЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DataProcessors/СравнениеДвиженийС81/Forms/РасшифровкаРезервов/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьРашифровкуНаСервере()
	
	Заголовок = "Несоответствие резервов: " + ВыбраннаяНоменклатура;
	
	ТаблицаДвижений.Очистить();
	ТаблицаДанных81 = ТаблицаДвижений.Выгрузить(); // подготовим структру для будущей таблицы
	
	Connector = КэшируемыеФункции.ИницилизироватьCOMConnector81();
	
	// Вытащим данные из 81
	
	СтрОшибки = "";
	
	РезультатЗапроса81 = COMServer.ПолучитьВыполнениеЗапроса81("
		|ВЫБРАТЬ
		|	Период,
		|	Регистратор,
		|	ВЫБОР КОГДА ВидДвижения = &ВидДвиженияПриход ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоПриход,
		|	Склад,
		|	Количество,
		|	ВЫБОР 
		|		КОГДА Регистратор ССЫЛКА Документ.ВнутреннийЗаказ ТОГДА ""ВнутреннийЗаказ""
		|		КОГДА Регистратор ССЫЛКА Документ.ЗаказПокупателя ТОГДА ""ЗаказПокупателя""
		|		КОГДА Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг ТОГДА ""РеализацияТоваров""
		|	ИНАЧЕ
		|		""Неопределено""
		|	КОНЕЦ КАК ВидДокумента
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах
		|ГДЕ
		|	Номенклатура = &Номенклатура
		|",, 
		Новый Структура("Номенклатура, ВидДвиженияПриход", 
							Connector.Справочники.Номенклатура.ПолучитьСсылку(Connector.NewObject("UUID", Строка(ВыбраннаяНоменклатура.УникальныйИдентификатор()))),
							Connector.ВидДвиженияНакопления.Приход),
		СтрОшибки);
		
	Если РезультатЗапроса81 = Неопределено Тогда
		
		ОбщиеФункции.СообщитьТекст(СтрОшибки);
		Возврат;
		
	КонецЕсли;
		
	Если Не РезультатЗапроса81.Пустой() Тогда
			
		// Загрузим сконвертировав данные из 81 в таблицу сравнения
		
		Выборка81 = РезультатЗапроса81.Выбрать();
		Пока Выборка81.Следующий() Цикл
			
			НовСтрока = ТаблицаДанных81.Добавить();
			НовСтрока.Склад 		= Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Connector.String("UUID", Выборка81.Склад.УникальныйИдентификатор())));
			НовСтрока.ВидДвижения  	= ?(Выборка81.ЭтоПриход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			НовСтрока.Количество  	= Выборка81.Количество;
			НовСтрока.Период  		= Выборка81.Период;
			НовСтрока.База			= "8.1";
			
			Если Выборка81.ВидДокумента <> "Неопределено" Тогда
				НовСтрока.Регистратор = Документы[Выборка81.ВидДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Connector.string(Выборка81.Регистратор.УникальныйИдентификатор())));
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Загрузим в SQL табличку из 81
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Таблица81.База,
	|	Таблица81.Период,
	|	Таблица81.Регистратор,
	|	Таблица81.ВидДвижения,
	|	Таблица81.Склад,
	|	Таблица81.Количество
	|ПОМЕСТИТЬ
	|	Таблица81
	|ИЗ
	|	&Таблица81 КАК Таблица81
	|");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Таблица81", ТаблицаДанных81);
	Запрос.Выполнить();
	
	// Сравним и найдем различия
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Таблица81.База, ""8.2"") 						КАК База,
	|	ЕСТЬNULL(Таблица81.Период, Таблица82.Период)			КАК Период,
	|	ЕСТЬNULL(Таблица81.Регистратор, Таблица82.Регистратор)	КАК Регистратор,
	|	ЕСТЬNULL(Таблица81.ВидДвижения, Таблица82.ВидДвижения) 	КАК ВидДвижения,
	|	ЕСТЬNULL(Таблица81.Склад, Таблица82.Размещение) 		КАК Склад,
	|	ЕСТЬNULL(Таблица81.Количество, Таблица82.Количество) 	КАК Количество
	|ИЗ
	|	Таблица81 КАК Таблица81
	|
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ * ИЗ РегистрНакопления.ТоварыВРезерве ГДЕ Номенклатура = &Номенклатура) КАК Таблица82
	|ПО
	|	Таблица81.Регистратор = Таблица82.Регистратор И
	|	Таблица81.ВидДвижения = Таблица82.ВидДвижения И
	|	Таблица81.Склад = Таблица82.Размещение И
	|	Таблица81.Количество = Таблица82.Количество И
	|	Таблица81.Период = Таблица82.Период
	|
	|ГДЕ
	|	Таблица81.Регистратор ЕСТЬ NULL ИЛИ Таблица82.Регистратор ЕСТЬ NULL
	|";

	Запрос.УстановитьПараметр("Номенклатура", ВыбраннаяНоменклатура);
	
	ТаблицаДвижений.Загрузить(Запрос.Выполнить().Выгрузить());
    		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРашифровку() Экспорт
	
	ОбновитьРашифровкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьРашифровку();
	
КонецПроцедуры
